---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.InvalidArcSegmentation
source: html/771039ef-e02f-79a5-be21-c68c26ef38f5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.InvalidArcSegmentation Property

A segmented slope-defining arc has too few segments.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidArcSegmentation { get; }
```